Repository: pedvieira/AppManager
Catalog: po/*.po
Languages: vi

source: Incompatible AppImage
vi: AppImage không tương thích

source: This AppImage is incompatible or corrupted. Missing required files (AppRun, .desktop, or icon).
vi: AppImage này không tương thích hoặc bị hỏng. Thiếu các tệp bắt buộc (AppRun, .desktop hoặc biểu tượng).

source: Close
vi: Đóng

source: unknown
vi: không xác định

source: Architecture Mismatch
vi: Kiến trúc không khớp

source: This app is built for %s and cannot run here
vi: Ứng dụng này được xây dựng cho %s và không thể chạy ở đây

source: Open %s?
vi: Mở %s?

source: Origins of %s application can not be verified. Are you sure you want to open it?
vi: Không thể xác minh nguồn gốc của ứng dụng %s. Bạn có chắc chắn muốn mở nó không?

source: Install the AppImage to add it to your applications.
vi: Cài đặt AppImage để thêm nó vào ứng dụng của bạn.

source: Install
vi: Cài đặt

source: Cancel
vi: Hủy

source: Update %s?
vi: Cập nhật %s?

source: Version unknown
vi: Không rõ phiên bản

source: Unknown version
vi: Phiên bản không xác định

source: Will update to version %s
vi: Sẽ cập nhật lên phiên bản %s

source: Update
vi: Cập nhật

source: Replace %s?
vi: Thay thế %s?

source: A newer item named %s already exists in this location. Do you want to replace it with the older one you're copying?
vi: Một mục mới hơn có tên %s đã tồn tại ở vị trí này. Bạn có muốn thay thế nó bằng cái cũ hơn mà bạn đang sao chép không?

source: Installed: %s | Incoming: %s
vi: Đã cài đặt: %s | Đang đến: %s

source: An item named %s already exists in this location. Do you want to replace it with one you're copying?
vi: Một mục có tên %s đã tồn tại ở vị trí này. Bạn có muốn thay thế nó bằng một cái bạn đang sao chép không?

source: Stop
vi: Dừng

source: Replace
vi: Thay thế

source: Successfully Updated
vi: Đã cập nhật thành công

source: Successfully Installed
vi: Đã được cài đặt thành công

source: Version %s
vi: Phiên bản %s

source: Open
vi: Mở

source: Done
vi: Xong

source: Installation failed
vi: Cài đặt không thành công

source: Dismiss
vi: Loại bỏ

source: Uninstall failed
vi: Gỡ cài đặt không thành công

source: %s could not be removed: %s
vi: %s không thể xóa được: %s

source: Moved to Trash
vi: Đã được chuyển vào Thùng rác

source: Extraction is only available for portable installations.
vi: Tính năng trích xuất chỉ khả dụng cho các bản cài đặt di động.

source: Extracted for faster launch
vi: Được trích xuất để khởi chạy nhanh hơn

source: Extraction complete
vi: Quá trình trích xuất hoàn tất

source: %s was extracted and will open faster.
vi: %s đã được giải nén và sẽ mở nhanh hơn.

source: Extraction failed
vi: Trích xuất không thành công

source: %s could not be extracted: %s
vi: %s không thể trích xuất được: %s

source: App updates available
vi: Có sẵn bản cập nhật ứng dụng

source: %d app update(s) available
vi: %d có sẵn (các) bản cập nhật ứng dụng

source: Open AppManager
vi: Mở AppManager

source: Move to Trash
vi: Chuyển vào Thùng rác

source: Path must be absolute
vi: Đường dẫn phải tuyệt đối

source: This is already the current directory
vi: Đây đã là thư mục hiện tại

source: Directory is not writable
vi: Thư mục không thể ghi được

source: Cannot access directory: %s
vi: Không thể truy cập thư mục: %s

source: Path exists but is not a directory
vi: Đường dẫn tồn tại nhưng không phải là thư mục

source: Invalid path
vi: Đường dẫn không hợp lệ

source: Parent directory does not exist
vi: Thư mục gốc không tồn tại

source: Cannot create directory: parent is not writable
vi: Không thể tạo thư mục: cha mẹ không thể ghi được

source: Cannot access parent directory: %s
vi: Không thể truy cập thư mục mẹ: %s

source: Failed to create directory: %s
vi: Không tạo được thư mục: %s

source: Failed to create extracted directory: %s
vi: Không tạo được thư mục giải nén: %s

source: Migrating %s (%d/%d)…
vi: Đang di chuyển %s (%d/%d)…

source: Some apps failed to migrate: %s
vi: Một số ứng dụng không di chuyển được: %s

source: No update address configured
vi: Không có địa chỉ cập nhật configured

source: Update source not supported
vi: Nguồn cập nhật không được hỗ trợ

source: Unable to read releases
vi: Không thể đọc bản phát hành

source: No matching AppImage found for %s
vi: Không tìm thấy AppImage phù hợp cho %s

source: Already up to date
vi: Đã cập nhật

source: Updated to %s
vi: Đã cập nhật thành %s

source: Server does not provide change tracking headers
vi: Máy chủ không cung cấp tiêu đề theo dõi thay đổi

source: Baseline recorded
vi: Đã ghi lại đường cơ sở

source: Updated
vi: Đã cập nhật

source: GitHub authentication failed (401). Check your token in Preferences → GitHub.
vi: Xác thực GitHub không thành công (401). Kiểm tra token của bạn trong Tùy chọn → GitHub.

source: GitHub API rate limit exceeded. Add a token in Preferences → GitHub to increase your limit.
vi: Đã vượt quá giới hạn tốc độ API GitHub. Thêm token trong Tùy chọn → GitHub để tăng giới hạn của bạn.

source: GitHub access forbidden (403). Your token may lack the required permissions.
vi: Truy cập GitHub bị cấm (403). Token của bạn có thể thiếu các quyền cần thiết.

source: Unknown zsync source type
vi: Loại nguồn zsync không xác định

source: Unknown zsync source
vi: Nguồn zsync không xác định

source: Cannot determine download URL from zsync URL
vi: Không thể xác định URL tải xuống từ URL zsync

source: ⚠️ '%s' is not in $PATH. App will not launch from the terminal
vi: ⚠️ '%s' không có trong $PATH. Ứng dụng sẽ không khởi chạy từ terminal

source: Show in Files
vi: Hiển thị trong Tệp

source: Portable
vi: Di động

source: Extracted
vi: Đã được trích xuất

source: This app supports efficient delta updates
vi: Ứng dụng này hỗ trợ cập nhật delta hiệu quả

source: Hidden
vi: Ẩn

source: Properties
vi: Thuộc tính

source: Command line arguments
vi: Đối số dòng lệnh

source: Update info
vi: Thông tin cập nhật

source: How update links work
vi: Cách liên kết cập nhật hoạt động

source: Update Link
vi: Liên kết cập nhật

source: Web Page
vi: Trang web

source: Open web page
vi: Mở trang web

source: Advanced
vi: Nâng cao

source: Environment Variables
vi: Biến môi trường

source: Set custom environment variables for this app
vi: Đặt các biến môi trường tùy chỉnh cho ứng dụng này

source: value
vi: giá trị

source: Remove variable
vi: Xóa biến

source: Keywords
vi: Từ khóa

source: Icon name
vi: Tên biểu tượng

source: Startup WM Class
vi: Lớp WM khởi động

source: Version
vi: Phiên bản

source: Hide from app drawer
vi: Ẩn khỏi ngăn kéo ứng dụng

source: Don't show in application menu
vi: Không hiển thị trong menu ứng dụng

source: Add to $PATH
vi: Thêm vào $PATH

source: Create a launcher in %s so you can run it from the terminal
vi: Tạo launcher trong %s để bạn có thể chạy nó từ terminal

source: Actions
vi: Hành động

source: Extract AppImage
vi: Trích xuất hình ảnh ứng dụng

source: Restore default
vi: Khôi phục mặc định

source: Updating...
vi: Đang cập nhật...

source: Checking...
vi: Đang kiểm tra...

source: Check Update
vi: Kiểm tra cập nhật

source: Update info lets AppManager fetch new builds for you. Paste the download link and AppManager will do the rest.
vi: Thông tin cập nhật cho phép AppManager tìm nạp các bản dựng mới cho bạn. Dán liên kết tải xuống và AppManager sẽ thực hiện phần còn lại.

source: Currently GitHub and GitLab URL formats are fully supported. Direct download links also work if the server provides Last-Modified or Content-Length headers.
vi: Hiện tại, các định dạng URL GitHub và GitLab được hỗ trợ đầy đủ. Liên kết tải xuống trực tiếp cũng hoạt động nếu máy chủ cung cấp tiêu đề Sửa đổi lần cuối hoặc Độ dài nội dung.

source: Update links
vi: Liên kết cập nhật

source: Got it
vi: Hiểu rồi

source: Extracting will unpack the application so it opens faster, but it will consume more disk space. This action cannot be reversed automatically.
vi: Việc giải nén sẽ giải nén ứng dụng để ứng dụng mở nhanh hơn nhưng sẽ tiêu tốn nhiều dung lượng ổ đĩa hơn. Hành động này không thể tự động đảo ngược được.

source: Extract application?
vi: Giải nén ứng dụng?

source: Extract
vi: Trích xuất

source: App removed
vi: Đã xóa ứng dụng

source: The application was uninstalled successfully.
vi: Ứng dụng đã được gỡ cài đặt thành công.

source: AppImage Installer
vi: Trình cài đặt AppImage

source: Verify
vi: Xác minh

source: Verify AppImage with SHA256 hash
vi: Xác minh AppImage bằng hash SHA256

source: SHA256 hash does not match. Verification failed.
vi: Hash SHA256 không khớp. Xác minh không thành công.

source: Drag and drop to install into Applications
vi: Kéo và thả để cài đặt vào Ứng dụng

source: Applications
vi: Ứng dụng

source: This is a terminal application and will be installed in portable mode.
vi: Đây là ứng dụng terminal và sẽ được cài đặt ở chế độ di động.

source: This AppImage is incompatible or corrupted
vi: AppImage này không tương thích hoặc bị hỏng

source: Missing required files (AppRun, .desktop, or icon)
vi: Thiếu các tệp bắt buộc (AppRun, .desktop hoặc biểu tượng)

source: Architecture mismatch
vi: Kiến trúc không khớp

source: Unable to prepare AppImage for installation
vi: Không thể chuẩn bị AppImage để cài đặt

source: Successfully Replaced
vi: Đã được thay thế thành công

source: Verify AppImage
vi: Xác minh AppImage

source: Verify the authenticity of this AppImage.
vi: Xác minh tính xác thực của AppImage này.

source: Enter the SHA256 hash
vi: Nhập hàm hash SHA256

source: AppManager
vi: Trình quản lý ứng dụng

source: Get more ...
vi: Nhận thêm ...

source: Find more AppImages
vi: Tìm thêm Hình ảnh ứng dụng

source: Browse these sources to discover and download AppImages
vi: Duyệt qua các nguồn này để khám phá và tải xuống Hình ảnh ứng dụng

source: No AppImage apps installed
vi: Chưa cài đặt ứng dụng AppImage

source: Download AppImage and double click to install with AppManager
vi: Tải xuống AppImage và nhấp đúp để cài đặt bằng AppManager

source: No results found
vi: Không tìm thấy kết quả

source: My Apps
vi: Ứng dụng của tôi

source: Update available
vi: Đã có bản cập nhật

source: Unknown
vi: Không xác định

source: extracted
vi: được trích xuất

source: Updated just now
vi: Vừa mới cập nhật

source: Installed just now
vi: Vừa được cài đặt

source: Updated %d min ago
vi: Đã cập nhật %d phút trước

source: Installed %d min ago
vi: Đã cài đặt %d phút trước

source: Updated %d hours ago
vi: Đã cập nhật %d giờ trước

source: Installed %d hours ago
vi: Đã cài đặt %d giờ trước

source: Updated %d days ago
vi: Đã cập nhật %d ngày trước

source: Installed %d days ago
vi: Đã cài đặt %d ngày trước

source: Preferences
vi: Tùy chọn

source: Keyboard shortcuts
vi: Phím tắt

source: About AppManager
vi: Giới thiệu AppManager

source: Quit
vi: Thoát

source: Support AppManager
vi: Hỗ trợ AppManager

source: Buy Me a Coffee
vi: Mua cho tôi một ly cà phê

source: Become a sponsor on GitHub
vi: Trở thành nhà tài trợ trên GitHub

source: Sponsor Me ♡
vi: Tài trợ cho tôi ♡

source: Star AppManager on GitHub
vi: Star AppManager trên GitHub

source: View contributors on GitHub
vi: Xem người đóng góp trên GitHub

source: Contributors
vi: Người đóng góp

source: Search
vi: Tìm kiếm

source: Support this project
vi: Hỗ trợ dự án này

source: More actions
vi: Các hành động khác

source: Search apps...
vi: Tìm kiếm ứng dụng...

source: FUSE is not installed. Some AppImages may fail to run
vi: FUSE chưa được cài đặt. Một số AppImages có thể không chạy được

source: Learn More
vi: Tìm hiểu thêm

source: Switch to grid view
vi: Chuyển sang chế độ xem dạng lưới

source: Switch to list view
vi: Chuyển sang chế độ xem danh sách

source: Updates already running
vi: Các bản cập nhật đã chạy

source: Cancel update
vi: Hủy cập nhật

source: Cancelling...
vi: Đang hủy...

source: Update check cancelled
vi: Đã hủy kiểm tra cập nhật

source: %d app(s) have updates
vi: %d ứng dụng có bản cập nhật

source: No updates available right now
vi: Hiện không có bản cập nhật nào

source: Nothing queued for updating
vi: Không có gì phải xếp hàng để cập nhật

source: Update cancelled
vi: Đã hủy cập nhật

source: Checking updates
vi: Kiểm tra cập nhật

source: Update Apps
vi: Cập nhật ứng dụng

source: Updating apps
vi: Cập nhật ứng dụng

source: Check updates
vi: Kiểm tra cập nhật

source: No installed apps to update
vi: Không có ứng dụng nào được cài đặt để cập nhật

source: Updated %d app(s)
vi: Đã cập nhật %d ứng dụng

source: %d update(s) failed
vi: %d cập nhật không thành công

source: Add update addresses in Details to enable updates
vi: Thêm địa chỉ cập nhật trong Chi tiết để bật cập nhật

source: All supported apps are already up to date
vi: Tất cả các ứng dụng được hỗ trợ đều đã được cập nhật

source: %d app(s) use unsupported update links
vi: %d ứng dụng sử dụng liên kết cập nhật không được hỗ trợ

source: Update available for %s
vi: Đã có bản cập nhật cho %s

source: General
vi: Tổng quan

source: Navigation
vi: Điều hướng

source: Window
vi: Cửa sổ

source: Check for updates
vi: Kiểm tra các bản cập nhật

source: Show main menu
vi: Hiển thị menu chính

source: Show shortcuts
vi: Hiển thị phím tắt

source: Close window
vi: Đóng cửa sổ

source: Quit AppManager
vi: Thoát AppManager

source: Credits
vi: Loc Huynh <https://github.com/hthienloc>

source: Installation
vi: Cài đặt

source: Configure where AppImages are installed (default: ~/Applications)
vi: Cấu hình nơi cài đặt AppImages (mặc định: ~/Applications)

source: Installation directory
vi: Thư mục cài đặt

source: Browse for folder
vi: Duyệt tìm thư mục

source: Reset to default
vi: Đặt lại về mặc định

source: Apply changes
vi: Áp dụng các thay đổi

source: Skip drag-and-drop window
vi: Bỏ qua cửa sổ kéo và thả

source: Show install dialog directly when opening AppImages
vi: Hiển thị hộp thoại cài đặt trực tiếp khi mở AppImages

source: Automatic updates
vi: Cập nhật tự động

source: Configure automatic update checking
vi: Configure kiểm tra cập nhật tự động

source: Open update log
vi: Mở nhật ký cập nhật

source: Background update check
vi: Kiểm tra cập nhật nền

source: Will notify when new app updates are available
vi: Sẽ thông báo khi có bản cập nhật ứng dụng mới

source: Auto update apps
vi: Tự động cập nhật ứng dụng

source: Will update apps automatically in background
vi: Sẽ tự động cập nhật ứng dụng ở chế độ nền

source: Check interval
vi: Khoảng thời gian kiểm tra

source: Daily
vi: Hàng ngày

source: Weekly
vi: Hàng tuần

source: Monthly
vi: Hàng tháng

source: Thumbnails
vi: Hình thu nhỏ

source: AppImage Thumbnailer
vi: Hình thu nhỏ hình ảnh ứng dụng

source: Install appimage-thumbnailer to generate thumbnails for AppImages
vi: Cài đặt appimage-thumbnailer để tạo hình thu nhỏ cho AppImages

source: Hide Nautilus thumbnail background
vi: Ẩn nền hình thu nhỏ Nautilus

source: Remove the alpha checkerboard behind thumbnails and icons
vi: Xóa bảng kiểm tra alpha đằng sau hình thu nhỏ và biểu tượng

source: Authenticate with GitHub to raise the API rate limit from 60 to 5,000 requests per hour
vi: Xác thực bằng GitHub để tăng giới hạn tốc độ API từ 60 lên 5.000 yêu cầu mỗi giờ

source: Personal access token
vi: Token truy cập cá nhân

source: Apply token
vi: Áp dụng token

source: GitHub token saved
vi: Đã lưu token GitHub

source: Clear token
vi: Xóa token

source: GitHub token cleared
vi: Đã xóa token GitHub

source: Test token
vi: Token kiểm tra

source: Verify your token works and check rate limit status
vi: Xác minh token của bạn hoạt động và kiểm tra trạng thái giới hạn tỷ lệ

source: Test
vi: Kiểm tra

source: Testing…
vi: Đang kiểm tra…

source: Create a token on GitHub
vi: Tạo token trên GitHub

source: Fine-grained token with read-only public repo access is sufficient
vi: Token chi tiết có quyền truy cập repo công khai chỉ đọc là đủ

source: Select Installation Directory
vi: Chọn thư mục cài đặt

source: Invalid Path
vi: Đường dẫn không hợp lệ

source: Installation directory updated
vi: Đã cập nhật thư mục cài đặt

source: Move Installed Apps?
vi: Di chuyển ứng dụng đã cài đặt?

source: This will move %d installed app(s) to the new location. This may take a while depending on the size of your apps.
vi: Thao tác này sẽ di chuyển %d ứng dụng đã cài đặt sang vị trí mới. Quá trình này có thể mất một lúc tùy thuộc vào kích thước ứng dụng của bạn.

source: Move Apps
vi: Di chuyển ứng dụng

source: Moving Apps…
vi: Di chuyển ứng dụng…

source: Please wait while your apps are being moved.
vi: Vui lòng đợi trong khi ứng dụng của bạn đang được di chuyển.

source: Apps moved successfully
vi: Ứng dụng đã được di chuyển thành công

source: Migration Failed
vi: Di chuyển không thành công

source: Unknown error occurred
vi: Đã xảy ra lỗi không xác định

source: Authentication failed — token is invalid or expired
vi: Xác thực không thành công - token không hợp lệ hoặc đã hết hạn

source: Access forbidden — token lacks required permissions
vi: Truy cập bị cấm - token thiếu các quyền cần thiết

source: Token is valid — %s / %s requests remaining
vi: Token hợp lệ — còn lại các yêu cầu %s / %s

source: Token is valid
vi: Token hợp lệ

source: Unexpected response (%u)
vi: Phản hồi không mong đợi (%u)

source: Connection error: %s
vi: Lỗi kết nối: %s

source: Drag-and-drop AppImage installer for GNOME
vi: Trình cài đặt AppImage kéo và thả cho GNOME

source: AppManager lets you install or uninstall AppImages with a familiar drag-and-drop workflow inspired by macOS. It handles desktop integration, icon extraction, executable bits, and Nautilus context menus.
vi: AppManager cho phép bạn cài đặt hoặc gỡ cài đặt AppImages bằng quy trình làm việc kéo và thả quen thuộc lấy cảm hứng từ macOS. Nó xử lý việc tích hợp máy tính để bàn, trích xuất biểu tượng, các bit thực thi và menu ngữ cảnh Nautilus.

source: Initial preview with drag-and-drop installs, dual install modes, Nautilus menus, and preferences UI.
vi: Bản xem trước ban đầu với cài đặt kéo và thả, chế độ cài đặt kép, menu Nautilus và giao diện người dùng tùy chọn.

source: Added optional background update checks powered by the XDG Background portal. Users grant permission on first launch, can pick an interval, and receive a notification when updates are detected.
vi: Đã thêm kiểm tra cập nhật nền tùy chọn được cung cấp bởi cổng XDG Background. Người dùng cấp quyền trong lần khởi chạy đầu tiên, có thể chọn khoảng thời gian và nhận thông báo khi phát hiện thấy bản cập nhật.
